# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリをインストール
tap "homebrew/core"
tap "homebrew/cask"
tap "buo/cask-upgrade"

# デスクトップアプリケーションの管理
cask "visual-studio-code"
cask "google-chrome"
cask "docker"
cask "alfred"
cask "warp"
cask "bitwarden"
cask "vivaldi"
cask "spotify"

# CLIアプリケーションの管理
brew "asdf"
brew "yarn"
brew "tree"
brew "git"
brew "git-lfs"
brew "docker"
brew "awscli"
brew "jq"
brew "ag"
brew "jump"
brew "mas"
brew "fzf"
brew "bat"
brew "gpg"
brew "hstr"
brew "starship"
brew "neovim"

# パスワード必要なので最後にやる
cask "microsoft-edge"
cask "karabiner-elements"